app/Controllers/Home.php

    public function adicionar(){
        $jantesModel = new JantesModel();

        $file = $this->request->getFile('Imagem');

        if ($file->isValid() && ! $file->hasMoved()) {
            $imageName = $file->getRandomName();
            $file->move('uploads/',$imageName);
        }

        $data = [
            'ano' => $this-> request->getPost('Nome'),
            'fabricante' => $this-> request->getPost('Fabricante'),
            'cor'  => $this-> request->getPost('Cor'),
            'preco'  => $this-> request->getPost('Preco'),
            'imagem'  => $imageName,


        ];

        $jantesModel->save($data);
---
INSERT INTO `jantes` (`ano`, `fabricante`, `cor`, `preco`, `imagem`) VALUES ('jante', 'Abarth', 'preto', '6000mt', '1689284646_b7894d2288b7a4aa8f89.webp')